<a href="https://colab.research.google.com/github/MagdaSousa/Estudo_Pandas/blob/master/dados_unicos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df2 =pd.DataFrame({'A':1,
                   'B':pd.Timestamp('20200101'),
                   'C':pd.Series(1, index=list(range(4)),dtype='float32'),
                   'D':np.array([3]*4,dtype='int32'),
                   'E':pd.Categorical(['train','test','train','test']),
                   'F': 'python',
                   'G':[2,2,4,4],
                   'H':[np.nan,2,4,np.nan]})

In [3]:
df2

   A          B    C  D      E       F  G    H
0  1 2020-01-01  1.0  3  train  python  2  NaN
1  1 2020-01-01  1.0  3   test  python  2  2.0
2  1 2020-01-01  1.0  3  train  python  4  4.0
3  1 2020-01-01  1.0  3   test  python  4  NaN

In [4]:
df2.nunique()# essa função nos permite ver a quantidade de valores únicos de acordo com cada coluna, 
#desconsiderando os valores nulos, por default.Ou seja  a coluna A , só trm um valor único e o resto é igual a ele

A    1
B    1
C    1
D    1
E    2
F    1
G    2
H    2
dtype: int64

In [5]:
df2.nunique(dropna=False)# contabilizando junto com os valores nulos

A    1
B    1
C    1
D    1
E    2
F    1
G    2
H    3
dtype: int64

In [6]:
df2.nunique(axis=1,dropna=False)# aqui ele está olhando na linha 0, quais itens são únicos

0    7
1    6
2    6
3    7
dtype: int64

In [8]:
df2.nunique(axis=1,dropna=True)

0    6
1    6
2    6
3    6
dtype: int64

Removendo duplicatas

In [9]:
df2

   A          B    C  D      E       F  G    H
0  1 2020-01-01  1.0  3  train  python  2  NaN
1  1 2020-01-01  1.0  3   test  python  2  2.0
2  1 2020-01-01  1.0  3  train  python  4  4.0
3  1 2020-01-01  1.0  3   test  python  4  NaN

In [10]:
df2.drop_duplicates()# Por padrão ele vai procurar uma linha exatamente igual a outra e apagar, como aqui não tem ele  não apaga

   A          B    C  D      E       F  G    H
0  1 2020-01-01  1.0  3  train  python  2  NaN
1  1 2020-01-01  1.0  3   test  python  2  2.0
2  1 2020-01-01  1.0  3  train  python  4  4.0
3  1 2020-01-01  1.0  3   test  python  4  NaN

In [11]:
df2.drop_duplicates(subset='G')# Setando uma coluna  no atributo subset, ele vai avaliar os repetidos por está coluna, e por padrão 
#mantem sempre o primeiro e os outros são excluídos

   A          B    C  D      E       F  G    H
0  1 2020-01-01  1.0  3  train  python  2  NaN
2  1 2020-01-01  1.0  3  train  python  4  4.0

In [12]:
df2.drop_duplicates(subset='G',keep='last')# Setando o atributo keep com o valor 'last' ,ele vai avaliar os repetidos por está coluna, e  
#manter o último e os outros são excluídos

   A          B    C  D     E       F  G    H
1  1 2020-01-01  1.0  3  test  python  2  2.0
3  1 2020-01-01  1.0  3  test  python  4  NaN